# Exploring Group By and Aggregate functions using Pandas

-----

## 1. Introduction

SQL groupby is probably the most popular feature for data transformation and it helps to be able to replicate the same form of data manipulation techniques using python for designing more advance data science systems. As a result, its important to understand the basic components of a groupby clause.

- Select - Is the list of aggregated features that the analyst is interested in
- From - Source of the data
- Group By - Feature(s) whose distinct values will be the basis of the grouping of selected aggregate features
- Where - Any additional conditions that need to be checked on the raw data, before grouping up the data
- Having - Any additional conditions that need to be checked on OUTPUT of the group by query, before displaying it

Keeping these concepts in mind, the Pandas groupby method will be explored in detail below.

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('data/train.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2. Syntax

The core syntax can be broken down similar to the Select-From-Groupby-Where clause. Sample code is given below :

`Table_name.groupby(['Group'])['Feature'].aggregation()`

- Table_name to specify the FROM
- 'Group' is the list of GROUP BY variables
- 'Feature' is the list of SELECT variables (with or without WHERE condition)
- Aggregate() is to specify the aggregation

In [9]:
#Two step query to find sum of survived people, grouped by their passenger class (1 > 2 > 3)
group_survived = df.groupby(['Pclass'])
out_survived = group_survived['Survived'].sum()
print(out_survived)

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [10]:
#Above snippet can be implemented in a single command as follows
out_survived = df.groupby(['Pclass'])['Survived'].sum()
print(out_survived)

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

## 2.1 Adding more groups/levels

We can pass a list of features in the groupby() to increase the levels of divisions in data as below :

In [21]:
#Three level groupby to find mean of age
output = df.groupby(['Survived','Pclass','Sex'])['Age'].mean()
print(output)

Survived  Pclass  Sex
0         1       female    25.666667
                  male      44.581967
          2       female    36.000000
                  male      33.369048
          3       female    23.818182
                  male      27.255814
1         1       female    34.939024
                  male      36.248000
          2       female    28.080882
                  male      16.022000
          3       female    19.329787
                  male      22.274211
Name: Age, dtype: float64

## 2.2 Adding more variables/features

Similarly, we can also pass a list of features after the groupby to increase the variables we want to aggregate, as below :

In [24]:
#Three level groupby to find mean of age and fares
#reset_index() just arranges the column names properly like a data frame
df.groupby(['Survived','Pclass','Sex'])['Age','Fare'].mean().reset_index()

    Survived  Pclass     Sex        Age        Fare
0          0       1  female  25.666667  110.604167
1          0       1    male  44.581967   62.894910
2          0       2  female  36.000000   18.250000
3          0       2    male  33.369048   19.488965
4          0       3  female  23.818182   19.773093
5          0       3    male  27.255814   12.204469
6          1       1  female  34.939024  105.978159
7          1       1    male  36.248000   74.637320
8          1       2  female  28.080882   22.288989
9          1       2    male  16.022000   21.095100
10         1       3  female  19.329787   12.464526
11         1       3    male  22.274211   15.579696

## 2.3 WHERE Clause

Adding a Where clause is quite intuitive as you can specify this as conditions before the groupby() method. This first applies the where condition on the dataframe, then groups it and aggregates given variables to throw results.

In [26]:
#Fare and Age average for only those who survived
df[df['Survived']==1].groupby(['Pclass','Sex'])['Age','Fare'].mean().reset_index()

   Pclass     Sex        Age        Fare
0       1  female  34.939024  105.978159
1       1    male  36.248000   74.637320
2       2  female  28.080882   22.288989
3       2    male  16.022000   21.095100
4       3  female  19.329787   12.464526
5       3    male  22.274211   15.579696

In [27]:
#The same query above can be broken down into 3 steps for better understanding
df1 = df[df['Survived']==1]
grouped_data = df1.groupby(['Pclass','Sex'])
output = grouped_data['Age','Fare'].mean()
print(output.reset_index())

   Pclass     Sex        Age        Fare
0       1  female  34.939024  105.978159
1       1    male  36.248000   74.637320
2       2  female  28.080882   22.288989
3       2    male  16.022000   21.095100
4       3  female  19.329787   12.464526
5       3    male  22.274211   15.579696

## 2.4 Multiple Aggregations - Stepwise

Till now only one aggregation is being applied on variables in all the examples above. Next is how to create multiple types of aggregations on data. This task can be performed step by step with first grouping the table, next creating 1 aggregate variable at a time, then finally combining them into a single dataframe using pd.DataFrame()

In [31]:
##Step 1: Group by Gender
groupby1 = df.groupby(['Sex'])

##Step 2: Calculate different aggregations on 'Fare' variable
meanfare = groupby1['Fare'].mean()
maxfare = groupby1['Fare'].max()
minfare = groupby1['Fare'].min()
stdfare = groupby1['Fare'].std()
rangefare = maxfare-minfare  #Can also create custom aggregations


##Step 3: Combine into a single DataFrame
#Min, Mean, Max
farestats1 = pd.DataFrame({'meanfare':meanfare,'maxfare':maxfare,'minfare':minfare})
#Mean, Range, Standard deviation
farestats2 = pd.DataFrame({'meanfare':meanfare,'stdfare':stdfare,'rangefare':rangefare})

print(farestats1.reset_index())
# print(farestats2.reset_index())

      Sex   meanfare   maxfare  minfare
0  female  44.479818  512.3292     6.75
1    male  25.523893  512.3292     0.00

## 2.5 Multiple Aggregations - using agg()

This is an advanced way of using multiple aggregations on different variables by use of AGG() and DICTIONARIES.

The difference between [ ] and { } parenthesis is that square brackets represent a list where each element is unique, while curly brackets represent a set(), where we have the ability to create dictionaries for later use. One such use of dictionaries is agg() method a.k.a aggregate method.

In [32]:
##First define the functions that need to be performed

#Dictionary 'f' uses 3 aggregations on same variable 'fare' 
f = {'Fare':['mean','max','min']}

#The dictionary is then passed into the aggregate() method
df.groupby(['Sex']).agg(f).reset_index()

      Sex       Fare
                mean       max   min
0  female  44.479818  512.3292  6.75
1    male  25.523893  512.3292  0.00

In [33]:
#Dictionary 'g' contains 2 separate aggregations on 2 different  variables 'fare' and 'age' respectively
g = {'Fare' : ['mean', 'max'], 'Age' : ['mean', 'max']}
df.groupby(['Sex']).agg(g).reset_index()

      Sex       Fare                  Age
                mean       max       mean   max
0  female  44.479818  512.3292  27.915709  63.0
1    male  25.523893  512.3292  30.726645  80.0

## 2.6 Renaming aggregated variables
Initialy while creating dictionaries, we used { } to define the first level of the dictionary, but the sub-levels were inputted still in [ ]. Here the only difference is that instead of passing a list [ ] into a dictionary element, we pass another dictionary to it, since we can associate labels to dictionary elements easily. For example :

- { 'element1' : ['a','b'] } is a dictionary with list 'a','b' passed to element1.
- { 'element1' : {'a','b'} } is a dictionary with dictionary 'a','b' passed to element1.

This allows adding labels to the dictionary inside as follows :

- { 'element1' : { 'label1':'a' , 'label2':'b' }}

In [34]:
#Dictionary h contains mean() as average, max() as maximas and min() as minimas, associated with variable 'fare'
h = {'Fare':{'average':'mean','maximas':'max','minimas':'min'}}
print(df.groupby(['Sex']).agg(h).reset_index())

      Sex       Fare
             average   maximas minimas
0  female  44.479818  512.3292    6.75
1    male  25.523893  512.3292    0.00

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\groupby\generic.py:1315: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

## 2.7 Custom Aggregations

There are 2 ways of creating custom aggregations. One is using the step by step method above to create the custom aggregation (as shown previously with 'Rangefare' aggregation). The other method is using LAMBDA X to create the aggregation, as shown below

In [35]:
#Lambda function can be associated with a calculation as well as a label to create custom aggregations
i = {'Fare':{'average':'mean','deviation':'std','range': lambda x : max(x)-min(x)}}
print(df.groupby(['Sex']).agg(i).reset_index())

      Sex       Fare
             average  deviation     range
0  female  44.479818  57.997698  505.5792
1    male  25.523893  43.138263  512.3292

## 3. Pandas predefined methods

This is a work in progress list of aggregate methods that can be used with groupby().

In [37]:
#Different methods can be called during pandas groupby and aggregate

non_null_count = df.groupby(['Sex'])['Age'].count()
summation = df.groupby(['Sex'])['Age'].sum()
average = df.groupby(['Sex'])['Age'].mean()
mean_absolute_dev = df.groupby(['Sex'])['Age'].mad()
arithmetic_median = df.groupby(['Sex'])['Age'].median()
maximum = df.groupby(['Sex'])['Age'].max()
minimum = df.groupby(['Sex'])['Age'].min()
product = df.groupby(['Sex'])['Age'].prod()
unbiased_std_dev = df.groupby(['Sex'])['Age'].std()
unbiased_variance = df.groupby(['Sex'])['Age'].var()
unbiased_std_err_of_mean = df.groupby(['Sex'])['Age'].sem()
unbiased_skewness_3rdmoment = df.groupby(['Sex'])['Age'].skew()

#cumsum1 = df.groupby(['sex'])['age'].cumsum()
#cumprod1 = df.groupby(['sex'])['age'].cumprod()
#cummax1 = df.groupby(['sex'])['age'].cummax()
#cummin1 = df.groupby(['sex'])['age'].cummin()
#quantile = df.groupby(['sex'])['age'].quantile()
#unbiased_kurtosis_4thmoment = df.groupby(['sex'])['age'].kurt()
#arithmetic_mode = df.groupby(['sex'])['age'].mode()
#absolute_value = df.groupby(['sex'])['age'].abs()

print(maximum)

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

## 4. Tuple based aggregations

In [72]:
animals = pd.DataFrame({'kind': ['cat', 'dog', 'cat', 'dog'],
   ...:                         'height': [9.1, 6.0, 9.5, 34.0],
   ...:                         'weight': [7.9, 7.5, 9.9, 198.0]})

In [73]:
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [74]:
animals.groupby("kind").agg(
   ...:     min_height=pd.NamedAgg(column='height', aggfunc='min'),
   ...:     max_height=pd.NamedAgg(column='height', aggfunc='max'),
   ...:     average_weight=pd.NamedAgg(column='weight', aggfunc=np.mean),
   ...: )

AttributeError: module 'pandas' has no attribute 'NamedAgg'

## 5. References

http://www.scipy-lectures.org/packages/statistics/index.html#hypothesis-testing-comparing-two-groups

https://www.simple-talk.com/sql/t-sql-programming/sql-group-by-basics/

http://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html